backend/views/user/admin/index.php

                        : $model->username;
                },
                'filterType' => GridView::FILTER_SELECT2,
                'filter' => yii\helpers\ArrayHelper::map(
                        common\models\user\User::find()->orderBy('username', 'ASC')->all(),
                        'username', 'username'),
---
SELECT * FROM `user` ORDER BY `username`

                        : $model->email;
                },
                'filterType' => GridView::FILTER_SELECT2,
                'filter' => yii\helpers\ArrayHelper::map(
                        common\models\user\User::find()->orderBy('email', 'ASC')->all(),
                        'email', 'email'),
---
SELECT * FROM `user` ORDER BY `email`

                        : $model->userRole;
                },
                'filterType' => GridView::FILTER_SELECT2,
                'filter' => yii\helpers\ArrayHelper::map(
                       backend\models\RoleTypes::find()->orderBy('name', 'ASC')->all(),
                        'id', 'name'),
---
SELECT * FROM `role_types` ORDER BY `name`

                        : $model->registration_ip;
                },
                'filterType' => GridView::FILTER_SELECT2,
                'filter' => yii\helpers\ArrayHelper::map(
                        common\models\user\User::find()->orderBy('registration_ip', 'ASC')->all(),
                        'registration_ip', 'registration_ip'),
---
SELECT * FROM `user` ORDER BY `registration_ip`