common/components/Pairs.php

SELECT * FROM `pair` WHERE `name`='arraysimple'
---
    protected function findModel($name) {
        if (($model = Pair::find()->where(['name'=>$name])->one()) !== null) {