common/models/user/User.php

    public function getUserRole(){
        $role = \backend\models\Roles::find()->where(['user_id'=>$this->id])->one();
---
SELECT * FROM `roles` WHERE `user_id`=1

    public function can($role){
        $userRole = \backend\models\Roles::find()->where(['user_id'=>$this->id])->one()->role_type_id;
        $hierarchy = \yii\helpers\ArrayHelper::map(\backend\models\RoleTypes::find()->all(), 'name', 'id');
---
SELECT * FROM `roles` WHERE `user_id`=1
SELECT * FROM `role_types`