common/controllers/user/SecurityController.php

SELECT * FROM `user` WHERE `username`='matricks'
---
    protected function hasBackendAccess($username){
        return \common\models\user\User::find()->where(['username'=>$username])->one()->getUserRole();